"""
^_^우리가 사랑하는 널 응원해~!
[메머드 커피 영수증]
포장
교환권 번호 : 500
판교 제 2테크노벨리점 매머드 커피
경기도 성남시 수정구 창업로 54 지하 1층 B10 5호
3480401419 / 최혜원 / TEL: false
주문번호 : 202300200005593
주문일시 : 2023-04-07 07:30:04
============================================
상품명                                   수량
--------------------------------------------
아메리카노
 -HOT
 -텀블러 할인
 -샷추가
============================================
공급가액
부가세
============================================
합계
결제금액
============================================
신용카드
승인금액 : 3000
할부개월 : 00
승인번호 : 75079328
승인일시 : 20230407073004
카드번호 : 655623**********
발급사 : SC비씨카드
매입사 : 비씨카드
가맹점번호 : 713055294
============================================
"""

coffee_list = [
    {"seq":1, "menu":"아메리카노", "price":"3000won"},
    {"seq":2, "menu":"카페라떼", "price":"3000won"},
    {"seq":3, "menu":"카푸치노", "price":"4500won"},
    {"seq":4, "menu":"녹차라떼", "price":"4000won"},
    {"seq":5, "menu":"유자차", "price":"3500won"},
    {"seq":6, "menu":"녹차", "price":"3500won"}
]

def title():
    print('^_^우리가 사랑하는 널 응원해~!'.center(40))
    print("[메머드 커피]".center(40))
    print("="*47)


def receipt():
    title()

    while True:

        for c in coffee_list:
            print("{:<3}|{:^15}|{:^10}".format('seq','price','menu'))
            print("-"*47)
            for i, c in enumerate(coffee_list):
                print("{:<3}|{:^15}|{:^10}".format(c['seq'], c['price'],c['menu']))
            no = int(input("\n주문 하실 커피 번호를 입력하세요: "))





if __name__ == '__main__':
    receipt()